;*****************************************************************************;
;            Language set file for plugins used by NativeLang.dll             ;
;*****************************************************************************;
;                                                                             ;
; Please change the file and distribute to the corresponding developer.       ;
;                                                                             ;
;*****************************************************************************;

; Multi Clipboard English Language Set
[MultiClipboard.dll NppMenu]
Main="&MultiClipboard"
0="&MultiClip Viewer...%tCtrl+Alt+V"
1="MultiClipboard &Paste%tCtrl+Shift+V"
2="&Options..."
3="&About..."

[MultiClipboard.dll About]
Caption="About"
30550="Author:"
30551="MultiClipboard Plugin v2.1 for Notepad++"
30552="Author:%t%tLoonyChewy"
30553="eMail:"
30555="URL:"
30557="Menu entries"
30558="MultiClip Viewer...%t%tToggles the MultiClip Viewer."
30559="MultiClipboard Paste%t%tShows the paste menu."
30560="Options...%t%t%tShows the option dialog."
30561="About...%t%t%tShows this dialog."

[MultiClipboard.dll Options]
Caption="MultiClipboard Options"
1003="Number of clip texts to store"
1004="Copy text from other programs"
1005="But only when pasted into Notepad++"
1006="Use paste menu (Uncheck: Use cyclic paste)"
1007="Use numbered mnemonics in paste menu"
1009="Width of paste menu"
1010="Auto copy text selection"
1011="Use middle click paste"
1012="Do not copy large text"
1013="No editing of large text"
1014="Paste All: Items in reverse order"
1015="Paste All: Newline between items"
1016="Persist clipboard list across sessions"

[MultiClipboard.dll Text]
MultiClip Viewer="MultiClip Viewer"
Move Item Up="Move Item Up"
Move Item Down="Move Item Down"
Paste Item="Paste Item"
Paste All Items="Paste All Items"
Copy To OS Clipboard="Copy To OS Clipboard"
Delete Item="Delete Item"
Delete All Items="Delete All Items"
MultiClipboard Options="MultiClipboard Options"
Large Text="Large Text"
1002_HELP="Maximum number of text to be stored in clipboard buffer"
1003_HELP="Maximum number of text to be stored in clipboard buffer"
1004_HELP="Get text that are copied from other programs"
1005_HELP="When 'Copy text from other programs' is true, then text is only copied when it is immediately pasted into Notepad++"
1006_HELP="Use paste menu instead of cyclic paste when Ctrl-Shift-V"
1007_HELP="Use numbers as shortcut keys for selecting menu items instead of the first character of the text"
1008_HELP="Maximum number of characters to display per text on the paste menu"
1009_HELP="Maximum number of characters to display per text on the paste menu"
1010_HELP="Automatically copies selected text into clipboard"
1011_HELP="Click middle mouse button to paste text from clipboard. Shift-middle click will show paste menu"
1012_HELP="Do not store large text into MultiClipboard plugin. Improves performance when copy and pasting very large text"
1013_HELP="Do not allow editing of large text in MultiClip Viewer. Improves performance when using the MultiClip Viewer"
1014_HELP="When pasting all items, paste them in reverse order of the clipboard list"
1015_HELP="When pasting all items, append a newline between each item"
1016_HELP="Persist the clipboard list across Notepad++ sessions"